#include "stm32f10x.h"
#include "IOCONFIG.H"
#include "QJBL.H"

/********************************************************************************************************************************
炜煌E26打印机串口控制及通讯处理程序
使用USART1串口,TTL232接口
此驱动程序没有使用中断方式，而是采用的查询方式
********************************************************************************************************************************/

/********************************************************************************************************************************
打印机使用的UART口初始化程序
********************************************************************************************************************************/
void Printer_UART_Configuration(void)
{
 USART_InitTypeDef USART_InitStructure;
 USART_InitStructure.USART_BaudRate            = 115200;             //设置通讯速率，打印机默认波特率115200
 USART_InitStructure.USART_WordLength          = USART_WordLength_8b;//8位数据位
 USART_InitStructure.USART_StopBits            = USART_StopBits_1;   //1位停止位
 USART_InitStructure.USART_Parity              = USART_Parity_No ;   //无奇偶校验
 USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;//禁止硬件流控制
 USART_InitStructure.USART_Mode                = USART_Mode_Tx;      //仅发送单向传输模式
 USART_Init(USART1, &USART_InitStructure);
 USART_Cmd(USART1, ENABLE);//使能USART1
}

/********************************************************************************************************************************
向打印机发送数据程序
参数:data 要发送的数据
********************************************************************************************************************************/
void Print_Data(unsigned char data)
{
 //只有打印机不忙，并且发送数据寄存器空时，才送数据
 while(PRINT_BUSY_STAT || (USART1->SR & 0x80) == 0);//判断PRINT-BUSY忙信号，以及发送数据寄存器空标志
 USART1->DR = data;
}

/********************************************************************************************************************************
打印机初始化程序
********************************************************************************************************************************/
void Printer_Init(void)
{
 Printer_UART_Configuration();     //初始化串口USART1
 Print_Data(0x1b);Print_Data(0x40);//打印机初始化命令
 PRINTING_FLAG = NO;               //初始化打印进行中标志
}

/********************************************************************************************************************************
打印字符串程序
********************************************************************************************************************************/
void Print_String(unsigned char *data)
{	
 while(*data)
   Print_Data(*(data++));
}

/********************************************************************************************************************************
打印换行程序
********************************************************************************************************************************/
void Print_Enter(unsigned char num)
{
 unsigned char i;
 for(i=0;i<num;i++)
  {
   Print_Data(0x0a);
  }
}

/********************************************************************************************************************************
打印数字程序
********************************************************************************************************************************/
void Print_Number(unsigned char number)
{   
 Print_Data(number+'0');
}

/********************************************************************************************************************************
打印测量结果程序
********************************************************************************************************************************/
void Print_Test_Data(void)
{
 unsigned int tmp;
 /*------------------------打印机初始化------------------------------*/
 Print_Data(0x1b);Print_Data(0x40);//打印机初始化命令
 Print_Data(0x1c);Print_Data(0x26);//进入汉字打印
 Print_Data(0x1b);Print_Data(0x7b);Print_Data(0x00);//允许反向打印
 Print_Data(0x1b);Print_Data(0x4d);Print_Data(0x00);//选择字符体12*24点阵
 Print_Data(0x1d);Print_Data(0x21);Print_Data(0x00);//字符宽、高1倍打印(原始大小)
 /*--------------------------打印表头--------------------------------*/



 Print_Enter(4);//打印换行，连续打印4行回车
 PRINTING_FLAG = NO; //打印结束
 SCRAPPLY      = YES;//请求窗口刷新
}
